app/views/orders/show.html.erb

SELECT  `orders`.* FROM `orders` WHERE `orders`.`id` = 1 LIMIT 1
---
          </div>
           <% orders= Order.where(id: params[:id]) %>