app/controllers/groups_controller.rb

SELECT `groups`.* FROM `groups`
---
  def index
    @groups = Group.all

INSERT INTO `groups` (`name`, `created_at`, `updated_at`) VALUES ('big bag', '2016-04-22 14:21:13', '2016-04-22 14:21:13')
---
  def create
    @group = Group.new(group_params)

    respond_to do |format|
      if @group.save

SELECT  `groups`.* FROM `groups` WHERE `groups`.`id` = 1 LIMIT 1
---
    def set_group
      @group = Group.find(params[:id])