app/controllers/orders_controller.rb

  def index
   #     @orders = Order.user_id.where(is_joined: 1 ).page(params[:page]).per(5)

   # @orders = Order.all.where(user_id: current_user.id  )

    @orders = Order.currentUserOrders(current_user.id).order("created_at desc").page(params[:page]).per(3)
    @orderJoined = OrdersUser.joinedOrders(current_user.id).order("created_at desc").page(params[:page]).per(3)

    @ordersJoined = []
    @orderJoined.each do |order|
---
SELECT `orders`.* FROM `orders`

  def create
  @order = Order.new(order_params)
    @order.user_id = current_user.id
    @order.status = 0
    users_arr = "[" + params[:users] + "]"
    users_ids = eval(users_arr)

    group_users_arr = "[" + params[:group_users] + "]"
    group_users_ids = eval(group_users_arr)

    users_ids.push(*group_users_ids)

    respond_to do |format|
      if @order.save
---
INSERT INTO `orders` (`image`, `for`, `from`, `created_at`, `updated_at`) VALUES ('aaaaa', 2, 'qqqqq', '2016-04-22 23:24:41', '2016-04-22 23:24:41')

  def destroy
    @order.destroy
---
DELETE FROM `orders` WHERE `orders`.`id` = 1

    def set_order
      @order = Order.find(params[:id])
---
SELECT  `orders`.* FROM `orders` WHERE `orders`.`id` = 1 LIMIT 1